package Lesson3;
/*
Дано число n, заполнить массив длинны n случайными числами из отрезка [-15; 17]
2.1) Найти наименьший нечетный элемент.
2.2) Найти второй по максимальности элемент массива (т.е. из чисел 1 2 3 4 - 3 будет вторым по максимальности)
2.3) Найти максимальный элемент массива и поменять его местами с 1-м (0-м по индексу) числом массива
 */
public class Les3HomeWorkTask2 {
    public static void main (String[] args) {
       int n = 17;
       int[] randMatrix = new int[n];


    }

}
